betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_smbus.c
/**
  *
  * @file    apm32f4xx_dal_smbus.c
  * @brief   SMBUS DAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the System Management Bus (SMBus) peripheral,
  *          based on SMBUS principals of operation :
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral State, Mode and Error functions
  *
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
    The SMBUS DAL driver can be used as follows:

    (#) Declare a SMBUS_HandleTypeDef handle structure, for example:
        SMBUS_HandleTypeDef  hsmbus;

    (#)Initialize the SMBUS low level resources by implementing the DAL_SMBUS_MspInit() API:
        (##) Enable the SMBUSx interface clock
        (##) SMBUS pins configuration
            (+++) Enable the clock for the SMBUS GPIOs
            (+++) Configure SMBUS pins as alternate function open-drain
        (##) NVIC configuration if you need to use interrupt process
            (+++) Configure the SMBUSx interrupt priority
            (+++) Enable the NVIC SMBUS IRQ Channel

    (#) Configure the Communication Speed, Duty cycle, Addressing mode, Own Address1,
        Dual Addressing mode, Own Address2, General call and Nostretch mode in the hsmbus Init structure.

    (#) Initialize the SMBUS registers by calling the DAL_SMBUS_Init(), configures also the low level Hardware
        (GPIO, CLOCK, NVIC...etc) by calling the customized DAL_SMBUS_MspInit(&hsmbus) API.

    (#) To check if target device is ready for communication, use the function DAL_SMBUS_IsDeviceReady()

    (#) For SMBUS IO operations, only one mode of operations is available within this driver :


    *** Interrupt mode IO operation ***
    ===================================

  [..]
      (+) Transmit in master/host SMBUS mode an amount of data in non blocking mode using DAL_SMBUS_Master_Transmit_IT()
      (++) At transmission end of transfer DAL_SMBUS_MasterTxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_SMBUS_MasterTxCpltCallback()
      (+) Receive in master/host SMBUS mode an amount of data in non blocking mode using DAL_SMBUS_Master_Receive_IT()
      (++) At reception end of transfer DAL_SMBUS_MasterRxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_SMBUS_MasterRxCpltCallback()
      (+) Abort a master/Host SMBUS process communication with Interrupt using DAL_SMBUS_Master_Abort_IT()
      (++) End of abort process, DAL_SMBUS_AbortCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_SMBUS_AbortCpltCallback()
      (+) Enable/disable the Address listen mode in slave/device or host/slave SMBUS mode
           using DAL_SMBUS_EnableListen_IT() DAL_SMBUS_DisableListen_IT()
      (++) When address slave/device SMBUS match, DAL_SMBUS_AddrCallback() is executed and user can
           add his own code to check the Address Match Code and the transmission direction request by master/host (Write/Read).
      (++) At Listen mode end DAL_SMBUS_ListenCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_SMBUS_ListenCpltCallback()
      (+) Transmit in slave/device SMBUS mode an amount of data in non blocking mode using DAL_SMBUS_Slave_Transmit_IT()
      (++) At transmission end of transfer DAL_SMBUS_SlaveTxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_SMBUS_SlaveTxCpltCallback()
      (+) Receive in slave/device SMBUS mode an amount of data in non blocking mode using DAL_SMBUS_Slave_Receive_IT()
      (++) At reception end of transfer DAL_SMBUS_SlaveRxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_SMBUS_SlaveRxCpltCallback()
      (+) Enable/Disable the SMBUS alert mode using DAL_SMBUS_EnableAlert_IT() and DAL_SMBUS_DisableAlert_IT()
      (++) When SMBUS Alert is generated DAL_SMBUS_ErrorCallback() is executed and user can
           add his own code by customization of function pointer DAL_SMBUS_ErrorCallback()
           to check the Alert Error Code using function DAL_SMBUS_GetError()
      (+) Get DAL state machine or error values using DAL_SMBUS_GetState() or DAL_SMBUS_GetError()
      (+) In case of transfer Error, DAL_SMBUS_ErrorCallback() function is executed and user can
           add his own code by customization of function pointer DAL_SMBUS_ErrorCallback()
           to check the Error Code using function DAL_SMBUS_GetError()


     *** SMBUS DAL driver macros list ***
     ==================================
     [..]
       Below the list of most used macros in SMBUS DAL driver.

