betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_smbus.c
/** @defgroup SMBUS_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing to initialize and
          deinitialize the SMBUSx peripheral:

      (+) User must Implement DAL_SMBUS_MspInit() function in which he configures
          all related peripherals resources (CLOCK, GPIO, IT and NVIC).

      (+) Call the function DAL_SMBUS_Init() to configure the selected device with
          the selected configuration:
        (++) Communication Speed
        (++) Addressing mode
        (++) Own Address 1
        (++) Dual Addressing mode
        (++) Own Address 2
        (++) General call mode
        (++) Nostretch mode
        (++) Packet Error Check mode
        (++) Peripheral mode

      (+) Call the function DAL_SMBUS_DeInit() to restore the default configuration
          of the selected SMBUSx peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the SMBUS according to the specified parameters
  *         in the SMBUS_InitTypeDef and initialize the associated handle.
  * @param  hsmbus pointer to a SMBUS_HandleTypeDef structure that contains
  *         the configuration information for the specified SMBUS
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SMBUS_Init(SMBUS_HandleTypeDef *hsmbus)
{
  uint32_t freqrange = 0U;
  uint32_t pclk1 = 0U;

  /* Check the SMBUS handle allocation */
  if (hsmbus == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_SMBUS_ALL_INSTANCE(hsmbus->Instance));
#if  defined(I2C_FILTER_ANFDIS)
  ASSERT_PARAM(IS_SMBUS_ANALOG_FILTER(hsmbus->Init.AnalogFilter));
#endif
  ASSERT_PARAM(IS_SMBUS_CLOCK_SPEED(hsmbus->Init.ClockSpeed));
  ASSERT_PARAM(IS_SMBUS_OWN_ADDRESS1(hsmbus->Init.OwnAddress1));
  ASSERT_PARAM(IS_SMBUS_ADDRESSING_MODE(hsmbus->Init.AddressingMode));
  ASSERT_PARAM(IS_SMBUS_DUAL_ADDRESS(hsmbus->Init.DualAddressMode));
  ASSERT_PARAM(IS_SMBUS_OWN_ADDRESS2(hsmbus->Init.OwnAddress2));
  ASSERT_PARAM(IS_SMBUS_GENERAL_CALL(hsmbus->Init.GeneralCallMode));
  ASSERT_PARAM(IS_SMBUS_NO_STRETCH(hsmbus->Init.NoStretchMode));
  ASSERT_PARAM(IS_SMBUS_PEC(hsmbus->Init.PacketErrorCheckMode));
  ASSERT_PARAM(IS_SMBUS_PERIPHERAL_MODE(hsmbus->Init.PeripheralMode));

  if (hsmbus->State == DAL_SMBUS_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hsmbus->Lock = DAL_UNLOCKED;
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
#if (USE_DAL_SMBUS_REGISTER_CALLBACKS == 1)
    /* Init the SMBUS Callback settings */
    hsmbus->MasterTxCpltCallback = DAL_SMBUS_MasterTxCpltCallback; /* Legacy weak MasterTxCpltCallback */
    hsmbus->MasterRxCpltCallback = DAL_SMBUS_MasterRxCpltCallback; /* Legacy weak MasterRxCpltCallback */
    hsmbus->SlaveTxCpltCallback  = DAL_SMBUS_SlaveTxCpltCallback;  /* Legacy weak SlaveTxCpltCallback  */
    hsmbus->SlaveRxCpltCallback  = DAL_SMBUS_SlaveRxCpltCallback;  /* Legacy weak SlaveRxCpltCallback  */
    hsmbus->ListenCpltCallback   = DAL_SMBUS_ListenCpltCallback;   /* Legacy weak ListenCpltCallback   */
    hsmbus->ErrorCallback        = DAL_SMBUS_ErrorCallback;        /* Legacy weak ErrorCallback        */
    hsmbus->AbortCpltCallback    = DAL_SMBUS_AbortCpltCallback;    /* Legacy weak AbortCpltCallback    */
    hsmbus->AddrCallback         = DAL_SMBUS_AddrCallback;         /* Legacy weak AddrCallback         */

    if (hsmbus->MspInitCallback == NULL)
    {
      hsmbus->MspInitCallback = DAL_SMBUS_MspInit; /* Legacy weak MspInit  */
    }

    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    hsmbus->MspInitCallback(hsmbus);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    DAL_SMBUS_MspInit(hsmbus);
#endif /* USE_DAL_SMBUS_REGISTER_CALLBACKS */
  }

  hsmbus->State = DAL_SMBUS_STATE_BUSY;

  /* Disable the selected SMBUS peripheral */
  __DAL_SMBUS_DISABLE(hsmbus);

  /* Get PCLK1 frequency */
  pclk1 = DAL_RCM_GetPCLK1Freq();

  /* Calculate frequency range */
  freqrange = SMBUS_FREQRANGE(pclk1);

  /*---------------------------- SMBUSx CTRL2 Configuration ----------------------*/
  /* Configure SMBUSx: Frequency range */
  MODIFY_REG(hsmbus->Instance->CTRL2, I2C_CTRL2_CLKFCFG, freqrange);

  /*---------------------------- SMBUSx RISETMAX Configuration --------------------*/
  /* Configure SMBUSx: Rise Time */
  MODIFY_REG(hsmbus->Instance->RISETMAX, I2C_RISETMAX_RISETMAX, SMBUS_RISE_TIME(freqrange));

  /*---------------------------- SMBUSx CLKCTRL Configuration ----------------------*/
  /* Configure SMBUSx: Speed */
  MODIFY_REG(hsmbus->Instance->CLKCTRL, (I2C_CLKCTRL_SPEEDCFG | I2C_CLKCTRL_FDUTYCFG | I2C_CLKCTRL_CLKS), SMBUS_SPEED_STANDARD(pclk1, hsmbus->Init.ClockSpeed));

  /*---------------------------- SMBUSx CTRL1 Configuration ----------------------*/
  /* Configure SMBUSx: Generalcall , PEC , Peripheral mode and  NoStretch mode */
  MODIFY_REG(hsmbus->Instance->CTRL1, (I2C_CTRL1_CLKSTRETCHD | I2C_CTRL1_SRBEN | I2C_CTRL1_PECEN | I2C_CTRL1_ARPEN | I2C_CTRL1_SMBTCFG | I2C_CTRL1_SMBEN), (hsmbus->Init.NoStretchMode | hsmbus->Init.GeneralCallMode |  hsmbus->Init.PacketErrorCheckMode | hsmbus->Init.PeripheralMode));

  /*---------------------------- SMBUSx SADDR1 Configuration ---------------------*/
  /* Configure SMBUSx: Own Address1 and addressing mode */
  MODIFY_REG(hsmbus->Instance->SADDR1, (I2C_SADDR1_ADDRLEN | I2C_SADDR1_ADDR8_9 | I2C_SADDR1_ADDR1_7 | I2C_SADDR1_ADDR0), (hsmbus->Init.AddressingMode | hsmbus->Init.OwnAddress1));

  /*---------------------------- SMBUSx SADDR2 Configuration ---------------------*/
  /* Configure SMBUSx: Dual mode and Own Address2 */
  MODIFY_REG(hsmbus->Instance->SADDR2, (I2C_SADDR2_ADDRNUM | I2C_SADDR2_ADDR2), (hsmbus->Init.DualAddressMode | hsmbus->Init.OwnAddress2));
#if  defined(I2C_FILTER_ANFDIS)
  /*---------------------------- SMBUSx FLTR Configuration ------------------------*/
  /* Configure SMBUSx: Analog noise filter */
  SET_BIT(hsmbus->Instance->FILTER, hsmbus->Init.AnalogFilter);
#endif

