betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_smbus.c
  /* Enable the selected SMBUS peripheral */
  __DAL_SMBUS_ENABLE(hsmbus);

  hsmbus->ErrorCode = DAL_SMBUS_ERROR_NONE;
  hsmbus->State = DAL_SMBUS_STATE_READY;
  hsmbus->PreviousState = SMBUS_STATE_NONE;
  hsmbus->Mode = DAL_SMBUS_MODE_NONE;
  hsmbus->XferPEC = 0x00;

  return DAL_OK;
}

/**
  * @brief  DeInitializes the SMBUS peripheral.
  * @param  hsmbus pointer to a SMBUS_HandleTypeDef structure that contains
  *         the configuration information for the specified SMBUS.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SMBUS_DeInit(SMBUS_HandleTypeDef *hsmbus)
{
  /* Check the SMBUS handle allocation */
  if (hsmbus == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_SMBUS_ALL_INSTANCE(hsmbus->Instance));

  hsmbus->State = DAL_SMBUS_STATE_BUSY;

  /* Disable the SMBUS Peripheral Clock */
  __DAL_SMBUS_DISABLE(hsmbus);

#if (USE_DAL_SMBUS_REGISTER_CALLBACKS == 1)
  if (hsmbus->MspDeInitCallback == NULL)
  {
    hsmbus->MspDeInitCallback = DAL_SMBUS_MspDeInit; /* Legacy weak MspDeInit  */
  }

  /* DeInit the low level hardware: GPIO, CLOCK, NVIC */
  hsmbus->MspDeInitCallback(hsmbus);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC */
  DAL_SMBUS_MspDeInit(hsmbus);
#endif /* USE_DAL_SMBUS_REGISTER_CALLBACKS */

  hsmbus->ErrorCode     = DAL_SMBUS_ERROR_NONE;
  hsmbus->State         = DAL_SMBUS_STATE_RESET;
  hsmbus->PreviousState = SMBUS_STATE_NONE;
  hsmbus->Mode          = DAL_SMBUS_MODE_NONE;

  /* Release Lock */
  __DAL_UNLOCK(hsmbus);

  return DAL_OK;
}

/**
  * @brief  Initialize the SMBUS MSP.
  * @param  hsmbus pointer to a SMBUS_HandleTypeDef structure that contains
  *         the configuration information for the specified SMBUS
  * @retval None
  */
__weak void DAL_SMBUS_MspInit(SMBUS_HandleTypeDef *hsmbus)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsmbus);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_SMBUS_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitialize the SMBUS MSP.
  * @param  hsmbus pointer to a SMBUS_HandleTypeDef structure that contains
  *         the configuration information for the specified SMBUS
  * @retval None
  */
__weak void DAL_SMBUS_MspDeInit(SMBUS_HandleTypeDef *hsmbus)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsmbus);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_SMBUS_MspDeInit could be implemented in the user file
   */
}

#if defined(I2C_FILTER_ANFDIS) && defined(I2C_FILTER_DNFCFG)
/**
  * @brief  Configures SMBUS Analog noise filter.
  * @param  hsmbus pointer to a SMBUS_HandleTypeDef structure that contains
  *                the configuration information for the specified SMBUSx peripheral.
  * @param  AnalogFilter new state of the Analog filter.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SMBUS_ConfigAnalogFilter(SMBUS_HandleTypeDef *hsmbus, uint32_t AnalogFilter)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMBUS_ALL_INSTANCE(hsmbus->Instance));
  ASSERT_PARAM(IS_SMBUS_ANALOG_FILTER(AnalogFilter));

  if (hsmbus->State == DAL_SMBUS_STATE_READY)
  {
    hsmbus->State = DAL_SMBUS_STATE_BUSY;

    /* Disable the selected SMBUS peripheral */
    __DAL_SMBUS_DISABLE(hsmbus);

    /* Reset SMBUSx ANFDIS bit */
    hsmbus->Instance->FILTER &= ~(I2C_FILTER_ANFDIS);

    /* Disable the analog filter */
    hsmbus->Instance->FILTER |= AnalogFilter;

    __DAL_SMBUS_ENABLE(hsmbus);

    hsmbus->State = DAL_SMBUS_STATE_READY;

    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Configures SMBUS Digital noise filter.
  * @param  hsmbus pointer to a SMBUS_HandleTypeDef structure that contains
  *                the configuration information for the specified SMBUSx peripheral.
  * @param  DigitalFilter Coefficient of digital noise filter between 0x00 and 0x0F.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SMBUS_ConfigDigitalFilter(SMBUS_HandleTypeDef *hsmbus, uint32_t DigitalFilter)
{
  uint16_t tmpreg = 0;

  /* Check the parameters */
  ASSERT_PARAM(IS_SMBUS_ALL_INSTANCE(hsmbus->Instance));
  ASSERT_PARAM(IS_SMBUS_DIGITAL_FILTER(DigitalFilter));

  if (hsmbus->State == DAL_SMBUS_STATE_READY)
  {
    hsmbus->State = DAL_SMBUS_STATE_BUSY;

    /* Disable the selected SMBUS peripheral */
    __DAL_SMBUS_DISABLE(hsmbus);

    /* Get the old register value */
    tmpreg = hsmbus->Instance->FILTER;

    /* Reset SMBUSx DNFCFG bit [3:0] */
    tmpreg &= ~(I2C_FILTER_DNFCFG);

    /* Set SMBUSx DNFCFG coefficient */
    tmpreg |= DigitalFilter;

    /* Store the new register value */
    hsmbus->Instance->FILTER = tmpreg;

    __DAL_SMBUS_ENABLE(hsmbus);

    hsmbus->State = DAL_SMBUS_STATE_READY;

    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}
#endif /* I2C_FILTER_ANFDIS && I2C_FILTER_DNFCFG */
#if (USE_DAL_SMBUS_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User SMBUS Callback
  *         To be used instead of the weak predefined callback
  * @param  hsmbus Pointer to a SMBUS_HandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref DAL_SMBUS_MASTER_TX_COMPLETE_CB_ID Master Tx Transfer completed callback ID
  *          @arg @ref DAL_SMBUS_MASTER_RX_COMPLETE_CB_ID Master Rx Transfer completed callback ID
  *          @arg @ref DAL_SMBUS_SLAVE_TX_COMPLETE_CB_ID Slave Tx Transfer completed callback ID
  *          @arg @ref DAL_SMBUS_SLAVE_RX_COMPLETE_CB_ID Slave Rx Transfer completed callback ID
  *          @arg @ref DAL_SMBUS_LISTEN_COMPLETE_CB_ID Listen Complete callback ID
  *          @arg @ref DAL_SMBUS_ERROR_CB_ID Error callback ID
  *          @arg @ref DAL_SMBUS_ABORT_CB_ID Abort callback ID
  *          @arg @ref DAL_SMBUS_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref DAL_SMBUS_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SMBUS_RegisterCallback(SMBUS_HandleTypeDef *hsmbus, DAL_SMBUS_CallbackIDTypeDef CallbackID, pSMBUS_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hsmbus->ErrorCode |= DAL_SMBUS_ERROR_INVALID_CALLBACK;

    return DAL_ERROR;
  }
  /* Process locked */
  __DAL_LOCK(hsmbus);

  if (DAL_SMBUS_STATE_READY == hsmbus->State)
  {
    switch (CallbackID)
    {
      case DAL_SMBUS_MASTER_TX_COMPLETE_CB_ID :
        hsmbus->MasterTxCpltCallback = pCallback;
        break;

      case DAL_SMBUS_MASTER_RX_COMPLETE_CB_ID :
        hsmbus->MasterRxCpltCallback = pCallback;
        break;

      case DAL_SMBUS_SLAVE_TX_COMPLETE_CB_ID :
        hsmbus->SlaveTxCpltCallback = pCallback;
        break;

      case DAL_SMBUS_SLAVE_RX_COMPLETE_CB_ID :
        hsmbus->SlaveRxCpltCallback = pCallback;
        break;

      case DAL_SMBUS_LISTEN_COMPLETE_CB_ID :
        hsmbus->ListenCpltCallback = pCallback;
        break;

