betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_smbus.c
    /* Call user error callback */
#if (USE_DAL_SMBUS_REGISTER_CALLBACKS == 1)
    hsmbus->ErrorCallback(hsmbus);
#else
    DAL_SMBUS_ErrorCallback(hsmbus);
#endif /* USE_DAL_SMBUS_REGISTER_CALLBACKS */
  }
  /* STOP Flag is not set after a NACK reception */
  /* So may inform upper layer that listen phase is stopped */
  /* during NACK error treatment */
  if ((hsmbus->State == DAL_SMBUS_STATE_LISTEN) && ((hsmbus->ErrorCode & DAL_SMBUS_ERROR_AF) == DAL_SMBUS_ERROR_AF))
  {
    hsmbus->XferOptions = SMBUS_NO_OPTION_FRAME;
    hsmbus->PreviousState = SMBUS_STATE_NONE;
    hsmbus->State = DAL_SMBUS_STATE_READY;
    hsmbus->Mode = DAL_SMBUS_MODE_NONE;

    /* Call the Listen Complete callback, to inform upper layer of the end of Listen usecase */
#if (USE_DAL_SMBUS_REGISTER_CALLBACKS == 1)
    hsmbus->ListenCpltCallback(hsmbus);
#else
    DAL_SMBUS_ListenCpltCallback(hsmbus);
#endif /* USE_DAL_SMBUS_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  This function handles SMBUS Communication Timeout.
  * @param  hsmbus Pointer to a SMBUS_HandleTypeDef structure that contains
  *         the configuration information for SMBUS module
  * @param  Flag specifies the SMBUS flag to check.
  * @param  Status The new Flag status (SET or RESET).
  * @param  Timeout Timeout duration
  * @param  Tickstart Tick start value
  * @retval DAL status
  */
static DAL_StatusTypeDef SMBUS_WaitOnFlagUntilTimeout(SMBUS_HandleTypeDef *hsmbus, uint32_t Flag, FlagStatus Status, uint32_t Timeout, uint32_t Tickstart)
{
  /* Wait until flag is set */
  if (Status == RESET)
  {
    while (__DAL_SMBUS_GET_FLAG(hsmbus, Flag) == RESET)
    {
      /* Check for the Timeout */
      if (Timeout != DAL_MAX_DELAY)
      {
        if ((Timeout == 0U) || ((DAL_GetTick() - Tickstart) > Timeout))
        {
          hsmbus->PreviousState = SMBUS_STATE_NONE;
          hsmbus->State = DAL_SMBUS_STATE_READY;
          hsmbus->Mode = DAL_SMBUS_MODE_NONE;

          /* Process Unlocked */
          __DAL_UNLOCK(hsmbus);
          return DAL_TIMEOUT;
        }
      }
    }
  }
  return DAL_OK;
}

/**
  * @}
  */


#endif /* DAL_SMBUS_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

